Enums/РежимыФормированияРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РежимыФормированияРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Менеджером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыФормированияРасходныхОрдеров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по режиму формирования расходных ордеров.
//
// Параметры:
//  РежимФормированияРасходныхОрдеров	 - ПеречислениеСсылка.РежимыФормированияРасходныхОрдеров - режим формирования
//  расходных ордеров.
// 
// Возвращаемое значение:
//  Строка - подсказка по режиму формирования расходных ордеров.
//
Функция ПодсказкаПоРежимуФормирования(РежимФормированияРасходныхОрдеров) Экспорт
	
	Если РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически Тогда
		Возврат НСтр("ru = 'Ордера формируются и переформировываются автоматически после записи документов, влияющих на их формирование: заказов, накладных, заданий на перевозку.'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Кладовщиком Тогда
		Возврат НСтр("ru = 'Кладовщик вручную инициирует формирование и переформирование расходных ордеров по распоряжениям на отгрузку в рабочем месте ""Отгрузка"".'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Менеджером Тогда
		Возврат НСтр("ru = 'Менеджер инициирует формирование и переформирование расходных ордеров из списков распоряжений на отгрузку (т.е. из списков заказов и накладных). При использовании доставки ордера формирует менеджер по доставке в целом по заданию на перевозку.'");
	Иначе
		Возврат НСтр("ru = 'Определяет инициатора формирования расходных ордеров.'");
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
